      ******************************************************************
      * Copyright (c) Core DF. All rights reserved.
      * Core Auto cawbs working-storage copybook.
      ******************************************************************
       01  CAWBS-STATUS              PIC S9(9) COMP-5.
       01  CAWBS-ERROR               PIC X(512).
       01  CAWBS-PAYLOAD             PIC X(8192).
       01  CAWBS-ANSWER              PIC X(8192).
       01  CAWBS-STEPNAME            PIC X(128).
       01  CAWBS-KEYLIST             PIC X(512).
