      ******************************************************************
      * Copyright Core DF
      *
      * Licensed under the Apache License, Version 2.0 (the "License");
      * you may not use this file except in compliance with the License.
      * You may obtain a copy of the License at
      *
      *     http://www.apache.org/licenses/LICENSE-2.0
      *
      * Unless required by applicable law or agreed to in writing, software
      * distributed under the License is distributed on an "AS IS" BASIS,
      * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
      * See the License for the specific language governing permissions and
      * limitations under the License.
      * Core Auto cawbs working-storage copybook.
      ******************************************************************
       01  CAWBS-STATUS              PIC S9(9) COMP-5.
       01  CAWBS-ERROR               PIC X(512).
       01  CAWBS-PAYLOAD             PIC X(8192).
       01  CAWBS-ANSWER              PIC X(8192).
       01  CAWBS-STEPNAME            PIC X(128).
       01  CAWBS-KEYLIST             PIC X(512).
