      *> Copyright Core DF — Apache License 2.0
       01 TRANS-STATUS        PIC S9(9) COMP.
       01 TRANS-INPUT         PIC X(8192).
       01 TRANS-OUTPUT        PIC X(8192).
       01 TRANS-ERROR         PIC X(512).
